Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_lcdca.h
/**
 * \file
 *
 * \brief Component description for LCDCA
 *
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAM4L_LCDCA_COMPONENT_
#define _SAM4L_LCDCA_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR LCDCA */
/* ========================================================================== */
/** \addtogroup SAM4L_LCDCA LCD Controller */
/*@{*/

#define REV_LCDCA                   0x100

/* -------- LCDCA_CR : (LCDCA Offset: 0x00) ( /W 32) Control Register -------- */
#define LCDCA_CR_OFFSET             0x00         /**< \brief (LCDCA_CR offset) Control Register */
#define LCDCA_CR_RESETVALUE         0x00000000   /**< \brief (LCDCA_CR reset_value) Control Register */

#define LCDCA_CR_DIS_Pos            0            /**< \brief (LCDCA_CR) Disable */
#define LCDCA_CR_DIS                (0x1u << LCDCA_CR_DIS_Pos)
#define LCDCA_CR_EN_Pos             1            /**< \brief (LCDCA_CR) Enable */
#define LCDCA_CR_EN                 (0x1u << LCDCA_CR_EN_Pos)
#define LCDCA_CR_FC0DIS_Pos         2            /**< \brief (LCDCA_CR) Frame Counter 0 Disable */
#define LCDCA_CR_FC0DIS             (0x1u << LCDCA_CR_FC0DIS_Pos)
#define LCDCA_CR_FC0EN_Pos          3            /**< \brief (LCDCA_CR) Frame Counter 0 Enable */
#define LCDCA_CR_FC0EN              (0x1u << LCDCA_CR_FC0EN_Pos)
#define LCDCA_CR_FC1DIS_Pos         4            /**< \brief (LCDCA_CR) Frame Counter 1 Disable */
#define LCDCA_CR_FC1DIS             (0x1u << LCDCA_CR_FC1DIS_Pos)
#define LCDCA_CR_FC1EN_Pos          5            /**< \brief (LCDCA_CR) Frame Counter 1 Enable */
#define LCDCA_CR_FC1EN              (0x1u << LCDCA_CR_FC1EN_Pos)
#define LCDCA_CR_FC2DIS_Pos         6            /**< \brief (LCDCA_CR) Frame Counter 2 Disable */
#define LCDCA_CR_FC2DIS             (0x1u << LCDCA_CR_FC2DIS_Pos)
#define LCDCA_CR_FC2EN_Pos          7            /**< \brief (LCDCA_CR) Frame Counter 2 Enable */
#define LCDCA_CR_FC2EN              (0x1u << LCDCA_CR_FC2EN_Pos)
#define LCDCA_CR_CDM_Pos            8            /**< \brief (LCDCA_CR) Clear Display Memory */
#define LCDCA_CR_CDM                (0x1u << LCDCA_CR_CDM_Pos)
#define LCDCA_CR_WDIS_Pos           9            /**< \brief (LCDCA_CR) Wake up Disable */
#define LCDCA_CR_WDIS               (0x1u << LCDCA_CR_WDIS_Pos)
#define LCDCA_CR_WEN_Pos            10           /**< \brief (LCDCA_CR) Wake up Enable */
#define LCDCA_CR_WEN                (0x1u << LCDCA_CR_WEN_Pos)
#define LCDCA_CR_BSTART_Pos         11           /**< \brief (LCDCA_CR) Blinking Start */
#define LCDCA_CR_BSTART             (0x1u << LCDCA_CR_BSTART_Pos)
#define LCDCA_CR_BSTOP_Pos          12           /**< \brief (LCDCA_CR) Blinking Stop */
#define LCDCA_CR_BSTOP              (0x1u << LCDCA_CR_BSTOP_Pos)
#define LCDCA_CR_CSTART_Pos         13           /**< \brief (LCDCA_CR) Circular Shift Start */
#define LCDCA_CR_CSTART             (0x1u << LCDCA_CR_CSTART_Pos)
#define LCDCA_CR_CSTOP_Pos          14           /**< \brief (LCDCA_CR) Circular Shift Stop */
#define LCDCA_CR_CSTOP              (0x1u << LCDCA_CR_CSTOP_Pos)
#define LCDCA_CR_MASK               0x00007FFFu  /**< \brief (LCDCA_CR) MASK Register */

/* -------- LCDCA_CFG : (LCDCA Offset: 0x04) (R/W 32) Configuration Register -------- */
#define LCDCA_CFG_OFFSET            0x04         /**< \brief (LCDCA_CFG offset) Configuration Register */
#define LCDCA_CFG_RESETVALUE        0x00000000   /**< \brief (LCDCA_CFG reset_value) Configuration Register */

#define LCDCA_CFG_XBIAS_Pos         0            /**< \brief (LCDCA_CFG) External Bias Generation */
#define LCDCA_CFG_XBIAS             (0x1u << LCDCA_CFG_XBIAS_Pos)
#define LCDCA_CFG_WMOD_Pos          1            /**< \brief (LCDCA_CFG) Waveform Mode */
#define LCDCA_CFG_WMOD              (0x1u << LCDCA_CFG_WMOD_Pos)
#define LCDCA_CFG_BLANK_Pos         2            /**< \brief (LCDCA_CFG) Blank LCD */
#define LCDCA_CFG_BLANK             (0x1u << LCDCA_CFG_BLANK_Pos)
#define LCDCA_CFG_LOCK_Pos          3            /**< \brief (LCDCA_CFG) Lock */
#define LCDCA_CFG_LOCK              (0x1u << LCDCA_CFG_LOCK_Pos)
#define LCDCA_CFG_DUTY_Pos          8            /**< \brief (LCDCA_CFG) Duty Select */
#define LCDCA_CFG_DUTY_Msk          (0x3u << LCDCA_CFG_DUTY_Pos)
#define LCDCA_CFG_DUTY(value)       ((LCDCA_CFG_DUTY_Msk & ((value) << LCDCA_CFG_DUTY_Pos)))
#define LCDCA_CFG_FCST_Pos          16           /**< \brief (LCDCA_CFG) Fine Contrast */
#define LCDCA_CFG_FCST_Msk          (0x3Fu << LCDCA_CFG_FCST_Pos)
#define LCDCA_CFG_FCST(value)       ((LCDCA_CFG_FCST_Msk & ((value) << LCDCA_CFG_FCST_Pos)))
#define LCDCA_CFG_NSU_Pos           24           /**< \brief (LCDCA_CFG) Number of Segment Terminals in Use */
#define LCDCA_CFG_NSU_Msk           (0x3Fu << LCDCA_CFG_NSU_Pos)
#define LCDCA_CFG_NSU(value)        ((LCDCA_CFG_NSU_Msk & ((value) << LCDCA_CFG_NSU_Pos)))
#define LCDCA_CFG_MASK              0x3F3F030Fu  /**< \brief (LCDCA_CFG) MASK Register */

/* -------- LCDCA_TIM : (LCDCA Offset: 0x08) (R/W 32) Timing Register -------- */
#define LCDCA_TIM_OFFSET            0x08         /**< \brief (LCDCA_TIM offset) Timing Register */
#define LCDCA_TIM_RESETVALUE        0x00000000   /**< \brief (LCDCA_TIM reset_value) Timing Register */

#define LCDCA_TIM_PRESC_Pos         0            /**< \brief (LCDCA_TIM) LCD Prescaler Select */
#define LCDCA_TIM_PRESC             (0x1u << LCDCA_TIM_PRESC_Pos)
#define LCDCA_TIM_CLKDIV_Pos        1            /**< \brief (LCDCA_TIM) LCD Clock Division */
#define LCDCA_TIM_CLKDIV_Msk        (0x7u << LCDCA_TIM_CLKDIV_Pos)
#define LCDCA_TIM_CLKDIV(value)     ((LCDCA_TIM_CLKDIV_Msk & ((value) << LCDCA_TIM_CLKDIV_Pos)))
#define LCDCA_TIM_FC0_Pos           8            /**< \brief (LCDCA_TIM) Frame Counter 0 */
#define LCDCA_TIM_FC0_Msk           (0x1Fu << LCDCA_TIM_FC0_Pos)
#define LCDCA_TIM_FC0(value)        ((LCDCA_TIM_FC0_Msk & ((value) << LCDCA_TIM_FC0_Pos)))
#define LCDCA_TIM_FC0PB_Pos         13           /**< \brief (LCDCA_TIM) Frame Counter 0 Prescaler Bypass */
#define LCDCA_TIM_FC0PB             (0x1u << LCDCA_TIM_FC0PB_Pos)
#define LCDCA_TIM_FC1_Pos           16           /**< \brief (LCDCA_TIM) Frame Counter 1 */
#define LCDCA_TIM_FC1_Msk           (0x1Fu << LCDCA_TIM_FC1_Pos)
#define LCDCA_TIM_FC1(value)        ((LCDCA_TIM_FC1_Msk & ((value) << LCDCA_TIM_FC1_Pos)))
#define LCDCA_TIM_FC2_Pos           24           /**< \brief (LCDCA_TIM) Frame Counter 2 */
#define LCDCA_TIM_FC2_Msk           (0x1Fu << LCDCA_TIM_FC2_Pos)
#define LCDCA_TIM_FC2(value)        ((LCDCA_TIM_FC2_Msk & ((value) << LCDCA_TIM_FC2_Pos)))
#define LCDCA_TIM_MASK              0x1F1F3F0Fu  /**< \brief (LCDCA_TIM) MASK Register */

/* -------- LCDCA_SR : (LCDCA Offset: 0x0C) (R/  32) Status Register -------- */
#define LCDCA_SR_OFFSET             0x0C         /**< \brief (LCDCA_SR offset) Status Register */
#define LCDCA_SR_RESETVALUE         0x00000000   /**< \brief (LCDCA_SR reset_value) Status Register */

#define LCDCA_SR_FC0R_Pos           0            /**< \brief (LCDCA_SR) Frame Counter 0 Rollover */
#define LCDCA_SR_FC0R               (0x1u << LCDCA_SR_FC0R_Pos)
#define LCDCA_SR_FC0S_Pos           1            /**< \brief (LCDCA_SR) Frame Counter 0 Status */
#define LCDCA_SR_FC0S               (0x1u << LCDCA_SR_FC0S_Pos)
#define LCDCA_SR_FC1S_Pos           2            /**< \brief (LCDCA_SR) Frame Counter 1 Status */
#define LCDCA_SR_FC1S               (0x1u << LCDCA_SR_FC1S_Pos)
#define LCDCA_SR_FC2S_Pos           3            /**< \brief (LCDCA_SR) Frame Counter 2 Status */
#define LCDCA_SR_FC2S               (0x1u << LCDCA_SR_FC2S_Pos)
#define LCDCA_SR_EN_Pos             4            /**< \brief (LCDCA_SR) LCDCA Status */
#define LCDCA_SR_EN                 (0x1u << LCDCA_SR_EN_Pos)
#define LCDCA_SR_WEN_Pos            5            /**< \brief (LCDCA_SR) Wake up Status */
#define LCDCA_SR_WEN                (0x1u << LCDCA_SR_WEN_Pos)
#define LCDCA_SR_BLKS_Pos           6            /**< \brief (LCDCA_SR) Blink Status */
#define LCDCA_SR_BLKS               (0x1u << LCDCA_SR_BLKS_Pos)
#define LCDCA_SR_CSRS_Pos           7            /**< \brief (LCDCA_SR) Circular Shift Register Status */
#define LCDCA_SR_CSRS               (0x1u << LCDCA_SR_CSRS_Pos)
#define LCDCA_SR_CPS_Pos            8            /**< \brief (LCDCA_SR) Charge Pump Status */
#define LCDCA_SR_CPS                (0x1u << LCDCA_SR_CPS_Pos)
#define LCDCA_SR_MASK               0x000001FFu  /**< \brief (LCDCA_SR) MASK Register */

/* -------- LCDCA_SCR : (LCDCA Offset: 0x10) ( /W 32) Status Clear Register -------- */
#define LCDCA_SCR_OFFSET            0x10         /**< \brief (LCDCA_SCR offset) Status Clear Register */
#define LCDCA_SCR_RESETVALUE        0x00000000   /**< \brief (LCDCA_SCR reset_value) Status Clear Register */

#define LCDCA_SCR_FC0R_Pos          0            /**< \brief (LCDCA_SCR) Frame Counter 0 Rollover */
#define LCDCA_SCR_FC0R              (0x1u << LCDCA_SCR_FC0R_Pos)
#define LCDCA_SCR_MASK              0x00000001u  /**< \brief (LCDCA_SCR) MASK Register */

/* -------- LCDCA_DRL0 : (LCDCA Offset: 0x14) (R/W 32) Data Register Low 0 -------- */
#define LCDCA_DRL0_OFFSET           0x14         /**< \brief (LCDCA_DRL0 offset) Data Register Low 0 */
#define LCDCA_DRL0_RESETVALUE       0x00000000   /**< \brief (LCDCA_DRL0 reset_value) Data Register Low 0 */

#define LCDCA_DRL0_DATA_Pos         0            /**< \brief (LCDCA_DRL0) Segments Value */
#define LCDCA_DRL0_DATA_Msk         (0xFFFFFFFFu << LCDCA_DRL0_DATA_Pos)
#define LCDCA_DRL0_DATA(value)      ((LCDCA_DRL0_DATA_Msk & ((value) << LCDCA_DRL0_DATA_Pos)))
#define LCDCA_DRL0_MASK             0xFFFFFFFFu  /**< \brief (LCDCA_DRL0) MASK Register */

/* -------- LCDCA_DRH0 : (LCDCA Offset: 0x18) (R/W 32) Data Register High 0 -------- */
#define LCDCA_DRH0_OFFSET           0x18         /**< \brief (LCDCA_DRH0 offset) Data Register High 0 */
#define LCDCA_DRH0_RESETVALUE       0x00000000   /**< \brief (LCDCA_DRH0 reset_value) Data Register High 0 */

